Revit 2027 API
PointCloudInstance.ContainsScan Method
 Identifies whether the instance contains a scan.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsScan(
	string scanName
)
Public Function ContainsScan (
	scanName As String
) As Boolean
public:
bool ContainsScan(
	String^ scanName
)
member ContainsScan :
        scanName : string -> bool
Parameters
scanName String
 Name of the scan.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudInstance Class
Autodesk.Revit.DB Namespace